/*
  前端权限思路：
  1.前端自己写出权限映射,后端传来权限等级即可
*/
export const studentRouterMapping = {
  'Fname': '学籍管理',
  'F': {
    F1: '修改密码',
    F2: '查看信息',
    F3: '修改学籍'
  },
  'Sname': '选课管理',
  'S': {
    S1: '查看选课',
    S2: '选修课程',
    S3: '修改选课'
  },
  'Tname': '成绩管理',
  'T': {
    T1: '查询成绩'
  }
}

export const teacherRouterMapping = {
  'Fname': '学籍管理',
  'F': {
    F1: '添加学生信息',
    F2: '删除学生信息',
    F3: '修改学生信息'
  },
  'Sname': '选课管理',
  'S': {
    S1: '添加课程',
    S2: '删除课程',
    S3: '修改课程',
    S4: '查看选课详情'
  },
  'Tname': '成绩管理',
  'T': {
    T1: '查询成绩',
    T2: '删除成绩',
    T3: '查看成绩',
    T4: '修改学生成绩'
  }
}
